cases/submerged/rotational_x/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{{
	format		ascii;
	class		dictionary;
	object		blockMeshDict;
}}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

xmin {lb:.12f};
xmax {ub:.12f};
neglinner {lb_inner:.12f};
linner {ub_inner:.12f};

radius {radius:.12f};
negradius {negative_radius:.12f};
trigradius {sin45_radius:.12f};
negtrigradius {negative_sin45_radius:.12f};

xcells {resolution:d};
radialcellshalf {resolution_half:d};
radialcellsquarter {resolution_quarter:d};

vertices        
(
	($xmin  $neglinner $neglinner)
	($xmin  $linner    $neglinner)
	($xmin  $linner    $linner   )
	($xmin  $neglinner $linner   )
	($xmax  $neglinner $neglinner)
	($xmax  $linner    $neglinner)
	($xmax  $linner    $linner   )
	($xmax  $neglinner $linner   )    
    
	($xmin  $negtrigradius $negtrigradius)
	($xmin  $trigradius    $negtrigradius)
	($xmin  $trigradius    $trigradius   )
	($xmin  $negtrigradius $trigradius   )    
	($xmax  $negtrigradius $negtrigradius)
	($xmax  $trigradius    $negtrigradius)
	($xmax  $trigradius    $trigradius   )
	($xmax  $negtrigradius $trigradius   ) 
);

blocks          
(
	hex ( 0  1  2  3  4  5  6  7) all ($radialcellshalf $radialcellshalf    $xcells) simpleGrading (1 1 1)
	hex ( 8  9  1  0 12 13  5  4) all ($radialcellshalf $radialcellsquarter $xcells) simpleGrading (1 1 1)
	hex ( 9 10  2  1 13 14  6  5) all ($radialcellshalf $radialcellsquarter $xcells) simpleGrading (1 1 1)
	hex (10 11  3  2 14 15  7  6) all ($radialcellshalf $radialcellsquarter $xcells) simpleGrading (1 1 1)
	hex (11  8  0  3 15 12  4  7) all ($radialcellshalf $radialcellsquarter $xcells) simpleGrading (1 1 1)
);

edges           
(
	arc  8  9 ($xmin  0          $negradius)
	arc  9 10 ($xmin  $radius    0         )
	arc 10 11 ($xmin  0          $radius   )
	arc 11  8 ($xmin  $negradius 0         )
	arc 12 13 ($xmax  0          $negradius)
	arc 13 14 ($xmax  $radius    0         )
	arc 14 15 ($xmax  0          $radius   )
	arc 15 12 ($xmax  $negradius 0         )
);

boundary        
(
    minX
    {{
        type wall;
	faces
	( 
            (0 1 2 3)
            (8 9 1 0) 
            (9 10 2 1)
            (10 11 3 2)
            (11 8 0 3)
	);
    }}

    maxX
    {{
        type wall;
	faces
	( 
            (4 5 6 7)
            (12 13 5 4)
            (13 14 6 5)
            (14 15 7 6)
            (15 12 4 7)
	);
    }}

    outside
    {{
        type wall;
	faces
	( 
            (8 9 12 13)
            (9 10 13 14)
            (10 11 14 15)
            (11 8 15 12)
	);
    }}
);

mergePatchPairs 
(
);

